EVENTS = [
    {
        "title":       "Весняна толока в коледжі",
        "date":        "22 березня 2026",
        "time":        "10:00 – 14:00",
        "location":    "Подвір'я коледжу",
        "description": "Впорядкування території та створення затишного освітнього середовища після зимового періоду."
    },
    {
        "title":       "Зустріч із представником Національної поліції України щодо майбутнього професійного самовизначення",
        "date":        "23 березня 2026",
        "time":        "14:00 – 15:30",
        "location":    "Читальна зала",
        "description": "Зустріч учасників освітнього процесу випускних груп  із майором  Національної поліції України Степанією ЛОТОЦЬКОЮ, спрямована на профорієнтацію молоді."
    },
    {
        "title":       "День відкитих дверей",
        "date":        "25 травня 2026",
        "time":        "10:00 – 15:00",
        "location":    "Територія коледжу",
        "description": "Зустріч з учнями шкіл 9-х та 11-х класів."
    },
]
