# ─────────────────────────────────────────────
#  Розклад занять
#  Структура: SCHEDULE[група][день] = список пар
#  Кожна пара: { time, subject, teacher, room }
# ─────────────────────────────────────────────

SCHEDULE = {
    "КН-41": {
        "Понеділок": [
            {"time": "08:30 – 09:50", "subject": "Технології інтернет речей",   "teacher": "Штанько А. М.", "room": "306"},
            {"time": "10:00 – 11:20", "subject": "Адміністрування ПС і К",      "teacher": "Коведа О. Т.", "room": "301л (Б)"},
            {"time": "12:00 – 13:20", "subject": "Технології захисту інформації",  "teacher": "Загорянська О. І.", "room": "405"},
            {"time": "13:30 – 14:50", "subject": "Основи охорони праці та БЖД",    "teacher": "Томків Р. В.", "room": "304л"},
        ],
        "Вівторок": [
            {"time": "12:00 – 13:20", "subject": "Створення графічних моделей та анімація",   "teacher": "Дьома Н. М.", "room": "416"},
            {"time": "13:30 – 14:50", "subject": "Адміністрування ПС і К",    "teacher": "Коведа О. Т.", "room": "301л (Б)"},
        ],
        "Середа": [
            {"time": "10:00 – 11:20", "subject": "Технології інтернет речей",            "teacher": "Штанько А. М.", "room": "306"},
            {"time": "12:00 – 13:20", "subject": "Технології захисту інформації",           "teacher": "Загорянська О. І.", "room": "405"},
            {"time": "13:30 – 14:50", "subject": "Створення графічних моделей та анімація",             "teacher": "Дьома Н. М.", "room": "416"},
        ],
        "Четвер": [
            {"time": "13:30 – 14:50", "subject": "Створення графічних моделей та анімація",    "teacher": "Дьома Н. М.",    "room": "416"},
            {"time": "15:00 – 16:20", "subject": "Адміністрування ПС і К",    "teacher": "Коведа О. Т.",    "room": "301л (Б)"},
        ],
        "П'ятниця": [
            {"time": "08:30 – 09:50", "subject": "Основи охорони праці та БЖД",                     "teacher": "Томків Р. В.", "room": "304л"},
            {"time": "10:00 – 11:20", "subject": "Технології захисту інформації", "teacher": "Загорянська О. І.", "room": "405"},
            {"time": "12:00 – 13:20", "subject": "Технології інтернет речей",            "teacher": "Штанько А. М.", "room": "306"},
        ],
    },

    "КІ-41": {
        "Понеділок": [
            {"time": "08:30 – 09:50", "subject": "Архітектура комп'ютерів",          "teacher": "Шпікула М. О.", "room": "205л"},
            {"time": "10:00 – 11:20", "subject": "Електрорадіовимірювання",          "teacher": "к.т.н. Семянистий К. С.", "room": "304л"},
            {"time": "12:00 – 13:20", "subject": "Економіка та ПВ",         "teacher": "Підкуймуха Т. І.", "room": "418"},
            {"time": "13:30 – 14:50", "subject": "Програмування в Internet",    "teacher": "Тупичак І. В.",    "room": "202л"},
        ],
        "Вівторок": [
            {"time": "10:00 – 11:20", "subject": "Надійність, Д та ЕКС та М",         "teacher": "Красний А. О.",  "room": "306"},
            {"time": "12:00 – 13:20", "subject": "Електрорадіовимірювання",               "teacher": "к.т.н. Семянистий К. С.", "room": "304л"},
            {"time": "13:30 – 14:50", "subject": "Основи філософських знань",    "teacher": "Жукова Т. В.",    "room": "230"},
            {"time": "15:00 – 16:20", "subject": "Пари немає / Програмування в Internet",    "teacher": "Тупичак І. В.",    "room": "202л"},
        ],
        "Середа": [
            {"time": "08:30 – 09:50", "subject": "Архітектура комп'ютерів",             "teacher": "Шпікула М. О.", "room": "205л"},
            {"time": "10:00 – 11:20", "subject": "Електрорадіовимірювання",                   "teacher": "к.т.н. Семянистий К. С.", "room": "304л"},
            {"time": "12:00 – 13:20", "subject": "Економіка та ПВ",              "teacher": "Підкуймуха Т. І.", "room": "418"},
            {"time": "13:30 – 14:50", "subject": "Надійність, Д та ЕКС та М",    "teacher": "Красний А. О.",    "room": "306"},
        ],
        "Четвер": [
            {"time": "08:30 – 09:50", "subject": "Надійність, Д та ЕКС та М",    "teacher": "Красний А. О.",    "room": "306"},
            {"time": "10:00 – 11:20", "subject": "Економіка та ПВ",          "teacher": "Підкуймуха Т. І.", "room": "418"},
            {"time": "12:00 – 13:20", "subject": "Програмування в Internet",           "teacher": "Тупичак І. В.", "room": "202л"},
        ],
        "П'ятниця": [
            {"time": "08:30 – 09:50", "subject": "Програмування в Internet",         "teacher": "Тупичак І. В.",  "room": "202л"},
            {"time": "10:00 – 11:20", "subject": "Електрорадіовимірювання / Пари немає",             "teacher": "к.т.н. Семянистий К. С.", "room": "304л"},
        ],
    },

}
